app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
INSERT INTO "movies" ("vote_count", "vote_average", "title", "poster_path", "backdrop_path", "overview", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? AND "movies"."poster_path" = ? AND "movies"."backdrop_path" = ? AND "movies"."overview" = ? AND "movies"."release_date" = ? AND "movies"."vote_count" = ? AND "movies"."vote_average" = ? LIMIT ?
---
    def index
        tmdb = TmdbService.new
        body = tmdb.movies["results"]

        body.each do |movie|
            Movie.find_or_create_by(:title => movie["title"], :poster_path => movie["poster_path"], :backdrop_path => movie["backdrop_path"], :overview => movie["overview"], :release_date => movie["release_date"], :vote_count => movie["vote_count"], :vote_average => movie["vote_average"])
        end

        render(
            status: 200,
            json: Movie.all
        )